Revit 2027 API
UIThemeManager.CurrentTheme Property
 The current overall theme which impacts the Revit frame and canvas.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static UITheme CurrentTheme { get; set; }
Public Shared Property CurrentTheme As UITheme
	Get
	Set
public:
static property UITheme CurrentTheme {
	UITheme get ();
	void set (UITheme value);
}
static member CurrentTheme : UITheme with get, set
Property Value
UITheme
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace